Herimarque-soap-client/request/kind_list_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://apache.org/headers" xmlns:ser="http://service.kndcrlts.crlts.cha/">
   <soapenv:Header>
      <head:ComMsgHeader>
        <!--  <RequestMsgID>bkang721</RequestMsgID>
         <ServiceKey>r4kz8tI1CNlZ/CnyNqeS/qjFaWpwFfjbj+DlBFL7t5/aYDO5N63Ec748ICA0FQJ2dAzgWtY49qqNrgNF+dvubw==</ServiceKey> -->
         <RequestMsgID>netinamu42</RequestMsgID>
         <ServiceKey>6i1zuQWddVTMFSqlHyhnbw8VL7uvfuHHt3Pth12H3VuFrUvdzFRcfYBZRfTE0Eidf/hV3otAz36MR1F/VDWUDw==</ServiceKey>
      </head:ComMsgHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ser:getKndCrltsList>
         <arg0>
           <itemCd>code</itemCd>
           <pageMg>size</pageMg>
           <nowPageNo>pagenum</nowPageNo>
         </arg0>
      </ser:getKndCrltsList>
   </soapenv:Body>
</soapenv:Envelope> 